/* Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт,
какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3
*/

Console.Write("Введите число a=");
string numberA = Console.ReadLine();
int a = Convert.ToInt32(numberA)
Console.Write("Введите число b=");
string numberB = Console.ReadLine();
int b = Convert.ToInt32(numberB);